---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionNobleStatus
source: html/289dfe9f-c60c-bd97-fd17-37a48b77753a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionNobleStatus Property

"Noble Status"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionNobleStatus { get; }
```